stm32-rs/stm32f4xx-hal/src/serial.rs
        // Enable transmission and receiving
        // and configure frame
        USART::cr1().write(|w| {
            w.ue()
                .set_bit()
                .over8()
                .bit(over8)
                .te()
                .set_bit()
                .re()
                .set_bit()
                .m()
                .bit(match config.wordlength {
                    WordLength::DataBits8 => false,
                    WordLength::DataBits9 => true,
                })
                .pce()
                .bit(!matches!(config.parity, Parity::ParityNone))
                .ps()
                .bit(matches!(config.parity, Parity::ParityOdd))
        });

        match config.dma {
            DmaConfig::Tx => USART::cr3().write(|w| w.dmat().enabled()),
            DmaConfig::Rx => USART::cr3().write(|w| w.dmar().enabled()),
            DmaConfig::TxRx => USART::cr3().write(|w| w.dmar().enabled().dmat().enabled()),
            DmaConfig::None => {}
        }

        pins.0.set_alt_mode();
        pins.1.set_alt_mode();

        Ok(Serial {
            usart,
            pins,
            tx: Tx::new(),
            rx: Rx::new(),
        }
        .config_stop(config))
    }
    pub fn release(mut self) -> (USART, (TX, RX)) {
        self.pins.0.restore_mode();
        self.pins.1.restore_mode();

        (self.usart, self.pins)
    }
}

impl<USART, TX, WORD, const TXA: u8> Serial<USART, (TX, NoPin), WORD>
where
    TX: PinTx<USART, A = Const<TXA>> + SetAlternate<TXA>,
    USART: Instance,
{
    pub fn tx(
        usart: USART,
        tx_pin: TX,
        config: config::Config,
        clocks: Clocks,
    ) -> Result<Tx<USART, WORD>, config::InvalidConfig> {
        Self::new(usart, (tx_pin, NoPin), config, clocks).map(|s| s.split().0)
    }
}

impl<USART, RX, WORD, const RXA: u8> Serial<USART, (NoPin, RX), WORD>
where
    RX: PinRx<USART, A = Const<RXA>> + SetAlternate<RXA>,
    USART: Instance,
{
    pub fn rx(
        usart: USART,
        rx_pin: RX,
        config: config::Config,
        clocks: Clocks,
    ) -> Result<Rx<USART, WORD>, config::InvalidConfig> {
        Self::new(usart, (NoPin, rx_pin), config, clocks).map(|s| s.split().1)
    }
}

impl<USART, PINS, WORD> Serial<USART, PINS, WORD>
where
    USART: Instance,
{
    /// Starts listening for an interrupt event
    ///
    /// Note, you will also have to enable the corresponding interrupt
    /// in the NVIC to start receiving events.
    pub fn listen(&mut self, event: Event) {
        match event {
            Event::Rxne => USART::cr1().modify(|_, w| w.rxneie().set_bit()),
            Event::Txe => USART::cr1().modify(|_, w| w.txeie().set_bit()),
            Event::Idle => USART::cr1().modify(|_, w| w.idleie().set_bit()),
        }
    }

    /// Stop listening for an interrupt event
    pub fn unlisten(&mut self, event: Event) {
        match event {
            Event::Rxne => USART::cr1().modify(|_, w| w.rxneie().clear_bit()),
            Event::Txe => USART::cr1().modify(|_, w| w.txeie().clear_bit()),
            Event::Idle => USART::cr1().modify(|_, w| w.idleie().clear_bit()),
        }
    }

    /// Return true if the line idle status is set
    pub fn is_idle(&self) -> bool {
        USART::sr().read().idle().bit_is_set()
    }

    /// Return true if the tx register is empty (and can accept data)
    pub fn is_tx_empty(&self) -> bool {
        USART::sr().read().txe().bit_is_set()
    }

    /// Return true if the rx register is not empty (and can be read)
    pub fn is_rx_not_empty(&self) -> bool {
        USART::sr().read().rxne().bit_is_set()
    }

    /// Clear idle line interrupt flag
    pub fn clear_idle_interrupt(&self) {
        let _ = USART::sr().read();
        let _ = USART::dr().read();
    }

    pub fn split(self) -> (Tx<USART, WORD>, Rx<USART, WORD>) {
        (self.tx, self.rx)
    }
}

impl<USART, PINS> Serial<USART, PINS, u8>
where
    USART: Instance,
{
    /// Converts this Serial into a version that can read and write `u16` values instead of `u8`s
    ///
    /// This can be used with a word length of 9 bits.
    pub fn with_u16_data(self) -> Serial<USART, PINS, u16> {
        Serial {
            usart: self.usart,
            pins: self.pins,
            tx: Tx::new(),
            rx: Rx::new(),
        }
    }
}

impl<USART, PINS> Serial<USART, PINS, u16>
where
    USART: Instance,
{
    /// Converts this Serial into a version that can read and write `u8` values instead of `u16`s
    ///
    /// This can be used with a word length of 8 bits.
    pub fn with_u8_data(self) -> Serial<USART, PINS, u8> {
        Serial {
            usart: self.usart,
            pins: self.pins,
            tx: Tx::new(),
            rx: Rx::new(),
        }
    }
}

impl<USART, PINS, WORD> serial::Read<WORD> for Serial<USART, PINS, WORD>
where
    USART: Instance,
    Rx<USART, WORD>: serial::Read<WORD, Error = Error>,
{
    type Error = Error;

    fn read(&mut self) -> nb::Result<WORD, Error> {
        self.rx.read()
    }
}

impl<USART> serial::Read<u8> for Rx<USART, u8>
where
    USART: Instance,
{
    type Error = Error;

    fn read(&mut self) -> nb::Result<u8, Self::Error> {
        // Delegate to the Read<u16> implementation, then truncate to 8 bits
        Rx::<USART, u16>::new().read().map(|word16| word16 as u8)
    }
}

/// Reads 9-bit words from the UART/USART
///
/// If the UART/USART was configured with `WordLength::DataBits9`, the returned value will contain
/// 9 received data bits and all other bits set to zero. Otherwise, the returned value will contain
/// 8 received data bits and all other bits set to zero.
impl<USART> serial::Read<u16> for Rx<USART, u16>
where
    USART: Instance,
{
    type Error = Error;

    fn read(&mut self) -> nb::Result<u16, Error> {
        // NOTE(unsafe) atomic read with no side effects
        let sr = USART::sr().read();

        // Any error requires the dr to be read to clear
        if sr.pe().bit_is_set()
            || sr.fe().bit_is_set()
            || sr.nf().bit_is_set()
            || sr.ore().bit_is_set()
        {
            USART::dr().read();
        }

        Err(if sr.pe().bit_is_set() {
            Error::Parity.into()
        } else if sr.fe().bit_is_set() {
            Error::Framing.into()
        } else if sr.nf().bit_is_set() {
            Error::Noise.into()
        } else if sr.ore().bit_is_set() {
            Error::Overrun.into()
        } else if sr.rxne().bit_is_set() {
            // NOTE(unsafe) atomic read from stateless register
            return Ok(USART::dr().read().dr().bits());
        } else {
            nb::Error::WouldBlock
        })
    }
}

unsafe impl<USART> PeriAddress for Rx<USART, u8>
where
    USART: Instance,
{
    #[inline(always)]
    fn address(&self) -> u32 {
        USART::dr() as *const _ as u32
    }

    type MemSize = u8;
}

impl<USART, PINS, WORD> serial::Write<WORD> for Serial<USART, PINS, WORD>
where
    USART: Instance,
    Tx<USART, WORD>: serial::Write<WORD, Error = Error>,
{
    type Error = Error;

    fn flush(&mut self) -> nb::Result<(), Self::Error> {
        self.tx.flush()
    }

